In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data = pd.read_csv('summer_clean.csv')

In [3]:
data.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal,Event_type,Event_Medal,Team
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold,Men,2,No
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver,Men,2,No
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze,Men,3,No
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold,Men,3,No
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver,Men,3,No

In [4]:
data.reset_index(inplace=True)

In [5]:
data.head()

,index,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal,Event_type,Event_Medal,Team
0,0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold,Men,2,No
1,1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver,Men,2,No
2,2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze,Men,3,No
3,3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold,Men,3,No
4,4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver,Men,3,No

In [6]:
singles = data.loc[data['Team']=='No'].copy()

In [7]:
singles.shape

(11025, 13)

In [9]:
teamS = data.loc[data['Team']=='Yes'].copy()

In [10]:
teamS.shape

(20140, 13)

In [11]:
#dropping duplicate

In [15]:
teamS.drop_duplicates(subset=['Year',
                               'Sport',
                               'Discipline',
                               'Country',
                               'Event',
                               'Event_type',
                               'Medal'],inplace=True)

In [16]:
teamS.shape

(3679, 13)

In [17]:
pd.concat([singles,teamS]).shape

(14704, 13)

In [18]:
data_new = pd.concat([singles,teamS])

In [21]:
data_new.set_index('index',inplace=True)

In [22]:
data_new.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal,Event_type,Event_Medal,Team
index,,,,,,,,,,,,
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold,Men,2,No
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver,Men,2,No
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze,Men,3,No
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold,Men,3,No
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver,Men,3,No

In [23]:
data_new.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 14704 entries, 0 to 31036
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Year         14704 non-null  int64
 1   City         14704 non-null  object
 2   Sport        14704 non-null  object
 3   Discipline   14704 non-null  object
 4   Athlete      14704 non-null  object
 5   Country      14700 non-null  object
 6   Gender       14704 non-null  object
 7   Event        14704 non-null  object
 8   Medal        14704 non-null  object
 9   Event_type   14704 non-null  object
 10  Event_Medal  14704 non-null  int64
 11  Team         14704 non-null  object
dtypes: int64(2), object(10)
memory usage: 1.5+ MB

In [24]:
data_new_grouped = data_new.groupby(['Year','Country','Medal'])

In [26]:
data_new_grouped['Medal'].count()

Year  Country  Medal
1896  AUS      Gold       2
      AUT      Bronze     2
               Gold       2
               Silver     1
      DEN      Bronze     3
                         ..
2012  USA      Gold      46
               Silver    28
      UZB      Bronze     2
               Gold       1
      VEN      Gold       1
Name: Medal, Length: 2547, dtype: int64

In [27]:
data_new_unstack = data_new_grouped['Medal'].count().unstack(fill_value=0)

In [28]:
data_new_unstack

Medal         Bronze  Gold  Silver
Year Country
1896 AUS           0     2       0
     AUT           2     2       1
     DEN           3     1       2
     FRA           2     5       4
     GBR           2     2       3
...              ...   ...     ...
2012 UGA           0     1       0
     UKR           9     6       4
     USA          29    46      28
     UZB           2     1       0
     VEN           0     1       0

[1157 rows x 3 columns]

In [29]:
medal_tables = data_new_unstack[['Gold','Silver','Bronze']]

In [30]:
medal_tables

Medal         Gold  Silver  Bronze
Year Country
1896 AUS         2       0       0
     AUT         2       1       2
     DEN         1       2       3
     FRA         5       4       2
     GBR         2       3       2
...            ...     ...     ...
2012 UGA         1       0       0
     UKR         6       4       9
     USA        46      28      29
     UZB         1       0       2
     VEN         1       0       0

[1157 rows x 3 columns]

In [44]:
##############################
data_new.to_csv('medal_table.csv')